# a lot of this came from brew bundle dump
cask_args appdir: "~/Applications"
tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git"

## cask apps ##
# xquartz dependency
cask "xquartz"

# some stuff is commented out because it may already be installed on the system
# chat
#cask "slack"
# browsers
#cask "google-chrome"
#cask "firefox"
# fb messenger
#cask "goofy"
# secure chat
cask "keybase"
# terminal
cask "iterm2"
# editors
#cask "atom"
#cask "intellij-idea-ce"
cask "pycharm"
cask "visual-studio-code"
# source control gui
cask "sourcetree"
# database
cask "sqlworkbenchj"
cask "mysqlworkbench"
# data visualization
#cask "tableau-reader"
# vms
cask "virtualbox"
cask "virtualbox-extension-pack"
# vm manager
cask "vagrant"
#cask "vagrant-manager"
# containers
cask "docker"
# aws creds manager
cask "aws-vault"
# cloud drives
#cask "google-drive-file-stream"
#cask "onedrive"
cask "dropbox"
# install java dependency
cask "java"
# authenticator
cask "authy"
# password managers
#cask "lastpass"
#cask "1password"
# window manager
cask "spectacle"
# remove ambient blue at night
cask "flux"
# disable monitor
cask "disablemonitor"
# install different calendar
cask "itsycal"
# install js desktop widgets
cask "ubersicht"
# disk usage analyzer
cask "GrandPerspective"
# clean up
cask "cleanup"
cask "clean-me"
# remove apps completely
cask "appcleaner"
# cast to screen
cask "mkchromecast"
# player
cask "vlc"
# uploader
cask "transmit"
# install image editor
cask "gimp"
# install weather menu applet
#cask "temps"
# clipboard manager
cask "clipy"
# show keyboard shortcuts for apps
cask "cheatsheet"
# keep monitor from sleeping
cask "keepingyouawake"
# vpn software to connect to multiple
cask "tunnelblick"
# monospace font
tap "homebrew/cask-fonts"
cask "font-fira-code"
# hide menu items
cask "dozer"
# office suite
cask "libreoffice"
# make gifs from screen
cask "gifcapture"
# github notifications
cask "gitify"
## brew cli tools ##

# hit rest endpoints
brew "curl"
brew "httpie"
brew "wget"

# editors
brew "vim"
brew "neovim"
brew "nano"

# better greps
brew "ack"
brew "ripgrep"
brew "the_silver_searcher"

# rust version of cat
brew "bat"

# convert data like yaml2json
brew "remarshal"

# set default applications for file extensions
brew "duti"

# rdesktop for rdp
brew "rdesktop"

# make oneliner sql readable
brew "sqlparse"

# youtube downloader
brew "youtube-dl"
brew "ffmpeg"

# docker
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "xhyve"
brew "docker-machine-driver-xhyve"
# docker linter
brew "hadolint"

## search data
# json
brew "jq"
# jmespath
tap "jmespath/jmespath"
brew "jmespath/jmespath/jp"
# yaml
brew "yq"
# sql against csv
brew "q"
# better grep
brew "sift"
# xml
brew "xmlstarlet"

## python stuff
# install dependencies of pyenv
brew "readline"
brew "xz"
brew "pyenv"
# for easy python environments
brew "pipenv"

# language specific compilation and env tooling
brew "nvm"
brew "jenv"

# git
brew "git"
brew "git-extras"
brew "git-flow-avh"
brew "git-secrets"
# for github stuff
brew "hub"

# tldr docs better than man
brew "tldr"

# aws and cloud tools
brew "awscli"
# this will mount s3 buckets locally
brew "osxfuse"
brew "goofys"
# convert iam json to terraform
brew "iam-policy-json-to-terraform"
# pack images
brew "packer"
# lots of command foo with s3
brew "s3cmd"
# instead of terraform, install tf manager
# this also reads .terraform-version files and auto switches unlike chtf
brew "tfenv"
brew "terraform_landscape"
brew "tfsec"
brew "tflint"
brew "terraforming"
brew "terraformer"
brew "terraform-docs"

# zsh
brew "zsh"
brew "zsh-autosuggestions"

# network tools
brew "nmap"
brew "zmap"

# configuration saver
brew "mackup"

# provisioner 
#brew "ansible"
#brew "saltstack"

# modify images
brew "imagemagick"

# compile tools
brew "gcc"
brew "go"
brew "dep"

## security
# keepass cli
brew "pass"

# load .env files
brew "direnv"

# dns
brew "whois"
brew "adns"

# ssh
brew "sshuttle"
brew "ssh-copy-id"

# gnu
brew "coreutils"
brew "dos2unix"
brew "findutils"
brew "less"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "htop"
brew "make"
brew "tree"
brew "watch"
brew "rsync"

# mac apple store
brew "mas"

# for ftp
brew "lftp"

# for postgresql / redshift
brew "postgresql"

# from brew dump and uncategorized
brew "asciidoc"
brew "cmake"
brew "docbook"
brew "freetype"
brew "gdbm"
brew "geos"
brew "gettext"
brew "gmp"
brew "icu4c"
brew "jpeg"
brew "json-c"
brew "libassuan"
brew "libdnet"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libidn"
brew "libksba"
brew "libpng"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libyaml"
brew "moreutils"
brew "mpack"
brew "mpfr"
brew "ncdu"
brew "nettle"
brew "npth"
brew "oniguruma"
# should this be replaced with libressl?
brew "openssl"
#brew "libressl"
brew "p11-kit"
brew "p7zip"
brew "pcre"
brew "pinentry"
brew "pkg-config"
brew "proj"
brew "pyqt"
# unsure if these pythons are required if using pyenv
# cannot uninstall due to many dependencies
#brew "python"
#brew "python3"
brew "qrencode"
brew "qt"
brew "sip"
brew "sqlite"
brew "tmux"
brew "todo-txt"
brew "trash"
brew "wrk"
brew "zeromq"
