# a lot of this came from brew bundle dump
cask_args appdir: "~/Applications"
# tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git"

## cask apps ##
# xquartz dependency
cask "xquartz"

## some stuff is commented out because it may already be installed on the system
# keep monitor from sleeping
# This is closer to the top so the laptop will be uninterrupted while this runs
cask "keepingyouawake"
# authenticator
cask "authy"
# password managers
cask "1password"
cask "bitwarden"
cask "keepassxc"
# chat
cask "keybase"
cask "slack"
cask "zoom"
# browsers
# cask "chromium"
# cask "google-chrome"
cask "brave-browser"
cask "firefox"
# fb messenger
#cask "goofy"
# terminal
cask "iterm2"
# editors
#cask "atom"
#cask "intellij-idea-ce"
cask "pycharm-ce"
cask "visual-studio-code"
# source control gui
cask "sourcetree"
# database
# cask "sqlworkbenchj"
# cask "mysqlworkbench"
# data visualization
#cask "tableau-reader"
# vms
cask "virtualbox"
cask "virtualbox-extension-pack"
# vm manager
cask "vagrant"
#cask "vagrant-manager"
# containers
cask "docker"
# aws creds manager
#cask "aws-vault" # commented out because we want the --no-daemonize option which hasnt been merged yet
# aws ssm
cask "session-manager-plugin"
# cloud drives
#cask "google-drive-file-stream"
#cask "onedrive"
cask "dropbox"
# install java dependency
cask "java"
# force paste password as an apple script
cask "force-paste"
# firewall similar to little snitch
cask "lulu"
# window manager
cask "spectacle"
# remove ambient blue at night
cask "flux"
# disable monitor
cask "disablemonitor"
# install different calendar
cask "itsycal"
# install js desktop widgets
cask "ubersicht"
# disk usage analyzer
cask "GrandPerspective"
# clean up
cask "cleanup"
cask "clean-me"
# remove apps completely
cask "appcleaner"
# cast to screen
cask "mkchromecast"
# player
cask "vlc"
# uploader
cask "transmit"
# install image editor
cask "gimp"
cask "shapes"
#cask "drawio"
# install weather menu applet
#cask "temps"
# clipboard manager
cask "clipy"
# show keyboard shortcuts for apps
cask "cheatsheet"
# vpn software to connect to multiple
cask "tunnelblick"
cask "protonvpn"
# monospace font
tap "homebrew/cask-fonts"
cask "font-fira-code"
# hide menu items
# cask "dozer" # doesn't support m1
cask "hiddenbar"
# office suite
cask "libreoffice"
# make gifs from screen
cask "gifcapture"
# github notifications
cask "gitify"
# install sourcetrail for dependency graphs
cask "sourcetrail"
# good gui diff tool
cask "meld"
# google drive mount
cask "google-backup-and-sync"
# security
# cask "cyberduck"
# screenshot
cask "flameshot"
# safely login to aws
cask "leapp"

## brew cli tools ##

# manage leapp
brew "leapp-cli"

# hit rest endpoints
# pycurl requires this instead of the curl package
brew "curl-openssl"
# brew "curl" # due to pycurl
brew "httpie"
brew "wget"

# editors
brew "vim"
brew "neovim"
brew "nano"

# better greps
brew "ack"
brew "ripgrep"
brew "the_silver_searcher"

# rust version of cat
brew "bat"

# convert data like yaml2json
brew "remarshal"

# set default applications for file extensions
brew "duti"

# rdesktop for rdp
brew "rdesktop"

# make oneliner sql readable
brew "sqlparse"

# youtube downloader
brew "youtube-dl"
brew "ffmpeg"

# docker
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "xhyve"
brew "docker-machine-driver-xhyve"
brew "podman"
# docker linter
brew "hadolint"

## search data
# json
brew "jq"
# json paths
brew "gron"
# jmespath
tap "jmespath/jmespath"
brew "jmespath/jmespath/jp"
# jc for jsonifying command output
brew "jp"
# yaml
brew "yq"
# sql against csv
brew "q"
# better grep
brew "sift"
# xml
brew "xmlstarlet"

## python stuff
# install dependencies of pyenv
brew "readline"
brew "xz"
# brew "pyenv"
# for easy python environments
brew "pipenv"
brew "poetry"

# language specific compilation and env tooling
brew "nvm"
brew "jenv"

# git
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-flow-avh"
brew "git-secrets"
# for github stuff
#brew "hub"
brew "gh"

# tldr docs better than man
brew "tldr"

# aws and cloud/devops tools
brew "awscli"
# read aws cloudwatch logs
brew "awslogs"
# athena querying
brew "athenacli"
# deep merging yaml to create tfvars
brew "atmos"
# scrape cloudtrail
brew "trailscraper"
# this will mount s3 buckets locally
cask "osxfuse"
brew "goofys"
# convert iam json to terraform
brew "iam-policy-json-to-terraform"
# create infrastructure diagrams
brew "inframap"
# edit any terraform using the cli
brew "minamijoyo/hcledit/hcledit"
# rego policy check using open policy agent
brew "opa"
# pack images
brew "packer"
# lots of command foo with s3
brew "s3cmd"
# instead of terraform, install tf manager
# this also reads .terraform-version files and auto switches unlike chtf
# brew "tfenv"
brew "tgenv"
# get schema of terraform resources
brew "tfschema"
# update terraform module and provider versions
brew "minamijoyo/tfupdate/tfupdate"
# generate terraform code
brew "cdktf", args: ["ignore-dependencies"]
# linters
tap "liamg/tfsec"
brew "liamg/tfsec/tfsec"
brew "tflint"
# checkov linter
tap "bridgecrewio/checkov"
brew "checkov"
# module output doc automation
brew "terraform-docs"
# backporting terraform
brew "terraforming"
brew "terraformer"
# cloudcustodian
brew "c7n"
# policy_sentry
# cloudsplaining

# reverse url
brew "ngrok"

# shells
brew "zsh"
brew "zsh-autosuggestions"
brew "bash"
brew "shellcheck"

# network tools
brew "nmap"
brew "zmap"

# configuration saver
brew "mackup"

# provisioner 
#brew "ansible"
#brew "saltstack"

# modify images
brew "imagemagick"

# compile tools
brew "gcc"
brew "go"
# brew "dep"

# templating
brew "jinja2-cli"

## security
# test totp tokens locally
brew "oath-toolkit"
# keepass cli
brew "pass"
# snyk security scanner
tap "snyk/tap"
brew "snyk"
# docker checkers
brew "dive"
brew "skopeo"
# convert qr code to text
brew "zbar"

# load .env files
brew "direnv"

# dns
brew "whois"
brew "adns"

# ssh
brew "sshuttle"
brew "ssh-copy-id"

# gnu
## latest dig
brew "bind"
brew "coreutils"
brew "diffutils"
brew "dos2unix"
brew "findutils"
brew "less"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnupg"
brew "gnutls"
brew "gpatch"
brew "grep"
brew "htop"
brew "make"
brew "moreutils"
brew "tree"
brew "watch"
brew "rsync"

# mac apple store
brew "mas"

# for ftp
brew "lftp"

# for postgresql / redshift
brew "postgresql"

# for visualization graphs using the dot command
brew "graphviz"

# for precommit hooks from yaml files
brew "pre-commit"

# all *env instead of tfenv, rbenv, pyenv, etc
brew "asdf"

# watch a file or dir of files and run a custom command if modified
# brew "inotify-tools" # this is linux only
brew "fswatch"

# from brew dump and uncategorized
brew "asciidoc"
brew "cmake"
brew "docbook"
brew "freetype"
brew "gdbm"
brew "geos"
brew "gettext"
brew "gmp"
brew "icu4c"
brew "jpeg"
brew "json-c"
brew "libassuan"
brew "libdnet"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libidn"
brew "libksba"
brew "libpng"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libyaml"
brew "mtr"
brew "mpack"
brew "mpfr"
brew "ncdu"
brew "nettle"
brew "npth"
brew "oniguruma"
# should this be replaced with libressl?
brew "openssl"
#brew "libressl"
brew "p11-kit"
brew "p7zip"
brew "pcre"
brew "pinentry"
brew "pkg-config"
brew "proj"
brew "pyqt"
# unsure if these pythons are required if using pyenv
# cannot uninstall due to many dependencies
#brew "python"
#brew "python3"
brew "qrencode"
brew "qt"
brew "sip"
brew "sqlite"
brew "tmux"
brew "todo-txt"
brew "trash"
brew "wrk"
brew "zeromq"
brew "zip"
